docs/diagrams/include_diagram.mmd
flowchart
    subgraph C_0009392701334512935369[src]
    subgraph C_0002394840416120061501[Bank]
    C_0000529258628623449314[Bank.cpp]
    C_0004959706648474708623[Bank.hpp]
    end
    subgraph C_0001617240256891923844[BankAccount]
    C_0001999126956856393903[BankAccount.hpp]
    C_0016260587715478220546[BankAccount.cpp]
    end
    end
    C_0000529258628623449314 --> C_0004959706648474708623
    C_0004959706648474708623 --> C_0001999126956856393903
    C_0016260587715478220546 --> C_0001999126956856393903

%% Generated with clang-uml, version 0.5.3
%% LLVM version clang version 18.1.1 (https://github.com/llvm/llvm-project.git dba2a75e9c7ef81fe84774ba5eee5e67e01d801a)
